Tekla Open API Reference for Tekla Structures 2025
PlacingQuarterAttributes Constructor (Boolean, Boolean, Boolean, Boolean)
 Creates a new placing quarter attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingQuarterAttributes(
	bool TopLeft,
	bool TopRight,
	bool BottomLeft,
	bool BottomRight
)
Public Sub New (
	TopLeft As Boolean,
	TopRight As Boolean,
	BottomLeft As Boolean,
	BottomRight As Boolean
)
Parameters
TopLeft
Type: System.Boolean
 Defines whether the object can search for a suitable location in the top left direction.
TopRight
Type: System.Boolean
 Defines whether the object can search for a suitable location in the top right direction.
BottomLeft
Type: System.Boolean
 Defines whether the object can search for a suitable location in the bottom left direction.
BottomRight
Type: System.Boolean
 Defines whether the object can search for a suitable location in the bottom right direction.
See Also
Reference
PlacingQuarterAttributes Class
PlacingQuarterAttributes Overload
Tekla.Structures.Drawing Namespace